# PointSupportNode

Point support in point

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.point_support_node import PointSupportNode

# TODO update the JSON string below
json = "{}"
# create an instance of PointSupportNode from a JSON string
point_support_node_instance = PointSupportNode.from_json(json)
# print the JSON string representation of the object
print(PointSupportNode.to_json())

# convert the object into a dict
point_support_node_dict = point_support_node_instance.to_dict()
# create an instance of PointSupportNode from a dict
point_support_node_from_dict = PointSupportNode.from_dict(point_support_node_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)